<a href="https://colab.research.google.com/github/aminejguirim/artificial-intelligence-GoMyCode-/blob/main/Seance_3_Python_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
fruits = ["apples", "oranges", "cherries", "pears"]
quantities = [20, 33, 52, 10]
S = pd.Series([20, 33, 52, 10], index=fruits)
S2 = pd.Series([17, 13, 311, 32], index=fruits)
print(S)
#print("sum of s:", sum(S))

apples      20
oranges     33
cherries    52
pears       10
dtype: int64

In [ ]:
import numpy as np
import pandas as pd
my_numpy_array=np.random.randn(3,4)
df=pd.DataFrame(my_numpy_array, columns=list("abcd"))
print(df)

          0         1         2         3
0  1.017328 -0.155481 -0.598510  0.754330
1 -0.849134  0.275026  1.594869  0.201082
2 -0.608342 -1.981811  0.407040 -0.920109

In [ ]:
import numpy as np
import pandas as pd
cities={"name":["London","Berlin","Madrid","Rome"],
        "population":[77989,9898989,989898,98998],
        "country":["England","Germany","Spain","Italy"]}
city_frame=pd.DataFrame(cities)
#city_frame.head(2)#afficher les 2 premières lignes 
#city_frame.tail(1)#to show the last row of your data
#city_frame=city_frame.drop('name',axis=1)#to drop a column
city_frame
city_frame.iloc[2:3,2:4]
df.iloc[0]

0    1.017328
1   -0.155481
2   -0.598510
3    0.754330
Name: 0, dtype: float64

In [1]:
import numpy as np
import pandas as pd
cities={"name":["London","Berlin","Madrid","Rome"],
        "population":[77989,9898989,989898,98998],
        "country":["England","Germany","Spain","Italy"]}
city_frame=pd.DataFrame(cities)
#city_frame.head(2)#afficher les 2 premières lignes 
#city_frame.tail(1)#to show the last row of your data
#city_frame=city_frame.drop('name',axis=1)#to drop a column
city_frame

     name  population  country
0  London       77989  England
1  Berlin     9898989  Germany
2  Madrid      989898    Spain
3    Rome       98998    Italy

In [ ]:
import numpy as np
import pandas as pd
df=pd.read_csv("train.csv",encoding="ISO-8859-1")
df.head(5)

In [ ]:
from google.colab import files
uploaded = files.upload()

In [29]:
import pandas as pd
dict1 = {
    "Name": ["amine","eskender","emir","mohamed","seif","nacir"],
    "Lastname":["jguirim","jguirim","jguirim","miled","jguirim","migaou"],
    "Age": ["23","23","21","22","18","20"],
    "Role":["AI","Web","Data","Manager","Conseil","Meca"],
    "Home Adress":["manouba","nacer","nacer","qatar","sayada","sayada"]    
}
data = pd.DataFrame(dict1)
data.to_csv('Data.csv')
new_data=pd.read_csv('Data.csv')
new_data.head(5)
#new_data.tail(1)#to show the last row of your data
#new_data=new_data.drop('Unnamed:0',axis=1) to drop column 
#new_data.info() #to show general information of differrentcolumns such as the type
new_data['Age'].describe() #OKK
new_data[['Age','Home Adress']] #selecting multiple columns
new_data[0:4] #selecting multiple rows
new_data.iloc[2:5,2:5] #select rows and colums by number (order)
new_data.iloc[3]
#new_data.loc["amine":"emir","Lastname":"Role"],
#new_data.loc[['amine','emir']]
new_data=new_data.set_index('Name')
new_data
new_data[new_data["Age"]>22]
new_data[new_data["Role"]=="AI"]
#new_data["Full Name"]=new_data["Name"]+" "+new_data["Lastname"]
#new_data.head()
dict2 = {
    "Name" : ["ahmed"],
    "Lastname" : ["tlili"],
    "Age" : ["30"],
    "Role" : ["web"],
    "Home Adress": ["sousse"]
    }
data2 = pd.DataFrame(dict2)
new_data=pd.concat([new_data,data2])
new_data

          Unnamed: 0 Lastname Age     Role Home Adress   Name
amine            0.0  jguirim  23       AI     manouba    NaN
eskender         1.0  jguirim  23      Web       nacer    NaN
emir             2.0  jguirim  21     Data       nacer    NaN
mohamed          3.0    miled  22  Manager       qatar    NaN
seif             4.0  jguirim  18  Conseil      sayada    NaN
nacir            5.0   migaou  20     Meca      sayada    NaN
0                NaN    tlili  30      web      sousse  ahmed